[
  {
    "id": "1",
    "name": "Kevin Bryenton",
    "title": "General President",
    "bio": "Kevin Bryenton is a second-generation member of Local 721 (Toronto, Ontario), which he joined in 1987. He completed his apprenticeship as an ironworker generalist and was named the outstanding apprentice of the year. He has worked across all facets of the trade in multiple local jurisdictions, spending most of his time on the tools in the industrial and ornamental sectors. Bryenton was hired by Local 721 as an instructor in 1999; appointed apprenticeship coordinator in 2000; and elected to several local union offices through 2009, including vice president, examining committee, president and business agent. Bryenton was appointed general organizer in April 2009 and, in May, was appointed president of the Ontario Iron Workers District Council. On July 1, 2015, he was appointed general vice president. On July 1, 2019, he was appointed executive director of Canadian affairs. General Vice President Kevin Bryenton was appointed general secretary, effective Jan. 1, 2024. General Secretary Kevin Bryenton was unanimously elected general president, effective Jan. 1, 2026.",
    "image": "/images/leadership/kevin-bryenton.png"
  },
  {
    "id": "2",
    "name": "James Mahoney",
    "title": "General Secretary",
    "bio": "James Mahoney of Local 580 (New York) became an ironworker in 1982 and worked at all phases of the ornamental and architectural industry. As a journeyman, foreman and steward, he was known as a hard worker. Mahoney attended the New York State School of Industrial and Labor Relations at Cornell University, completing the two-year certificate program from 1991 to 1993. He was elected recording secretary in 1993, elected business agent in 1996, and appointed business manager in 2009. Mahoney served as chair of the Local 580 joint funds, delegate to the New York State District Council of Iron Workers and treasurer of the district. Effective May 1, 2015, James Mahoney was appointed general organizer. Effective Oct. 1, 2015, General Organizer James Mahoney was appointed ninth general vice president by General President Eric Dean. General Vice President James Mahoney was appointed general treasurer, effective Nov. 1, 2023. General Secretary James Mahoney was appointed general secretary, effective Jan. 1, 2026.",
    "image": "/images/leadership/james-mahoney.png"
  },
  {
    "id": "3",
    "name": "David Beard",
    "title": "General Treasurer",
    "bio": "David Beard began working as an ironworker in 1979, entered the Local 392 (East St. Louis, Ill.) apprenticeship in 1982, and graduated in 1985. He worked in the field for 25 years and served as a steward, foreman, general foreman and superintendent. Since being elected trustee in 1991, he has served as executive board member, recording secretary, vice president and business manager/financial secretary of Local 392. Beard was appointed as a general organizer, effective June 17, 2013. General Organizer David Beard promoted to general vice president, effective Feb. 3, 2020. General Vice President David Beard was appointed general treasurer, effective Jan. 1, 2026.",
    "image": "/images/leadership/david-beard.png"
  },
  {
    "id": "4",
    "name": "Michael Baker",
    "title": "General Vice President",
    "bio": "Mike Baker was accepted into the Local 21 apprenticeship program in 1989 and graduated in 1993. He served as sergeant-at-arms, vice president, executive board member and examining committee member before being elected to business manager/FST in 2005. Baker was appointed to the executive committee of the Nebraska AFL-CIO Council, president of the Nebraska Southwest Iowa Building Trades Committee and vice president of the Omaha Federation of Labor AFL-CIO. Effective April 1, 2015, FST-BM Mike Baker of Local 21 (Omaha, Neb.) was appointed general organizer. General Organizer Mike Baker promoted to general vice president, effective March 2, 2020.",
    "image": "/images/leadership/michael-baker.jpg"
  },
  {
    "id": "5",
    "name": "Kendall Martin",
    "title": "General Vice President",
    "bio": "Kendall Martin was initiated into Local 5 (Washington, D.C.) in May 1994 and served the apprenticeship from 1994 through 1998. Kendall worked his way up in the field as a journeyman, foreman, general foreman and superintendent. In 2008, he was elected business manager/FST, serving for seven years. Additionally, Martin also served on the Metro Washington Council AFL-CIO Executive Board and the Maryland State and Washington, D.C. AFL-CIO Executive Board. Effective January 11, 2016, Kendall Martin was appointed general organizer. Kendall Martin, general organizer, promoted to general vice president effective July 13, 2020.",
    "image": null
  },
  {
    "id": "6",
    "name": "Gregory \"Jack\" Jarrell",
    "title": "General Vice President",
    "bio": "Jack Jarrell joined Local 397 (Tampa, Fla.) in 1994, gained journeyman status in 1997 and was the outstanding apprentice of North America in 1998. Jarrell has held various positions and seats within the local union, as well as with the Florida AFL-CIO, state building trades, workforce and development boards. In August 2010, he was appointed to Local 397 financial secretary-treasurer/business manager. Jack Jarrell was appointed general organizer effective June 3, 2019. Jack Jarrell, general organizer, was promoted to general vice president effective July 1, 2021.",
    "image": "/images/leadership/jack-jarrell.png"
  },
  {
    "id": "7",
    "name": "David Osborne",
    "title": "General Vice President",
    "bio": "David Osborne, a fourth-generation ironworker from Local 433 (Los Angeles), joined the apprenticeship in 2002, after his service in the United States Marine Corps. He worked at Local 433 as an apprentice, journeyman, foreman and general foreman. In addition to working in the field, he also was elected to vice president and business agent. In 2017, he was hired by the District Council of California and Vicinity to serve as a district council organizer/representative. David Osborne was appointed general organizer effective April 19, 2018. On September 1, 2022, General Organizer Osborne was appointed ninth general vice president.",
    "image": "/images/leadership/david-osborne.png"
  },
  {
    "id": "8",
    "name": "James Gardiner",
    "title": "General Vice President",
    "bio": "Following in his father's footsteps, James Gardiner became an ironworker in 1985, serving his apprenticeship in Local 1 (Chicago). Gardiner is a proud member of Local 1, working in many facets of the trade. He was elected to serve as sergeant-at-arms and vice president. He served as FS/T for Local 1 for 19 years; he was elected trustee to the pension fund in 2002 and the apprenticeship fund in 2005. James Gardiner was appointed general organizer, effective January 1, 2020. General Organizer James Gardiner was appointed general vice president, effective March 1, 2023.",
    "image": "/images/leadership/james-gardiner.png"
  },
  {
    "id": "9",
    "name": "Colin Daniels",
    "title": "General Vice President",
    "bio": "Colin Daniels was indentured as an apprentice in Local 771 in 1998 and completed his apprenticeship in 2002. Daniels has worked on various construction jobs across western Canada as a connector, rigger, job steward and supervisor. Throughout his career with Local 771, Daniels has served the local in various capacities: executive board member, dispatcher, business agent, president and financial secretary/treasurer/business manager. He was also elected president of the Saskatchewan Provincial Building Trades Council in 2018. Colin Daniels of Local 771 (Regina, Saskatchewan) was appointed general organizer, effective May 20, 2019. On January 1, 2024, General Organizer Daniels was appointed general vice president and executive director in charge of Canadian affairs.",
    "image": "/images/leadership/colin-daniels.png"
  },
  {
    "id": "10",
    "name": "Michael Relyin",
    "title": "General Vice President",
    "bio": "Mike Relyin was indentured as an apprentice in Local 426 (Detroit) in 1988, completing a two-year apprenticeship and becoming a journeyman in 1990. He later became a member of Local 25 (Detroit) following the 1993 merger. Relyin worked in the reinforcing industry as a journeyman, foreman, general foreman and welder. In 1999, he was hired as a full-time instructor for teaching reinforcing, post tensioning, welding and safety. In 2002, he became the training coordinator, a position he held until he became a general organizer. While working as an instructor, he completed an Associate Degree of Applied Science in Mechanical Engineering Technology. He has been an AWS-certified welding inspector since 2000 and an AWS-accredited test facility assessor since 2008, when he began performing audits for the Ironworkers Welding Certification Program. The National Training Fund hired Mike Relyin as a general organizer, effective March 12, 2012. General Organizer Relyin became the director of the department of reinforcing ironworkers, effective Jan. 1, 2019. General Organizer/Director of the Department of Reinforcing Ironworkers, Mike Relyin, was appointed as the general vice president, effective Jan. 1, 2026.",
    "image": "/images/leadership/michael-relyin.png"
  },
  {
    "id": "11",
    "name": "Peter Myers",
    "title": "General Vice President",
    "bio": "Brother Peter Myers' ironworking career began in 1985, when he entered Local 580's apprenticeship program and graduated in 1988. He held several positions in Local 580, including sergeant-at-arms in 1993, recording secretary in 1999, fund administrator in 2001, and business agent in 2009. In 2015, Myers was appointed Local 580 business manager. Peter Myers was appointed general organizer, effective Oct. 23, 2023. General Organizer Myers also serves as president of the New York State Iron Workers District Council and the financial secretary/treasurer to the NYC Building and Construction Trades Council. General Organizer Peter Myers was appointed as the general vice president, effective Jan. 1, 2026.",
    "image": "/images/leadership/peter-myers.png"
  },
  {
    "id": "12",
    "name": "Jerry Wilson",
    "title": "General Vice President",
    "bio": "Jerry Wilson comes from an ironworking family, a third-generation union ironworker. His first job was a summer position at a steel fabrication shop while in high school. Later, he studied construction management at Northeast Louisiana University. After a four-year tour of duty with the U.S. Air Force, he returned home and started working out of Local 710 (Monroe, La.), working on projects throughout the South and Midwest. He was elected FST/BA in 1995 and held that position until 2008. He was hired in 2008 as a district council representative working for the Texas and the Mid-South States District Council. Jerry Wilson was appointed general organizer effective Oct. 1, 2019. General Organizer Jerry Wilson was appointed the general vice president, effective Jan. 1, 2026.",
    "image": "/images/leadership/jerry-wilson.png"
  },
  {
    "id": "13",
    "name": "Tom Baun",
    "title": "Special Project Director",
    "bio": "Tom Baun serves as the Special Product Director for the Ironworkers, bringing extensive expertise from the timber and wood products sector to one of the nation's most innovative construction trades. With a strong foundation in the timber industry and long-standing relationships across design, engineering, and construction networks, Tom plays a pivotal role in advancing product strategy and cross-industry collaboration for Ironworker members. Tom built his career in the timber and wood building products industry, working with leading organizations focused on sustainable wood design, construction, and mass-timber advocacy. He has deep experience engaging industry stakeholders, developing strategic partnerships, and supporting technical education initiatives that bridge traditional wood building practices with modern structural solutions. Tom's leadership and industry insight support the Ironworkers' mission to champion advanced product capabilities, elevate workforce skills, and foster collaboration across the broad spectrum of modern construction disciplines—including the growing intersection of steel and engineered wood building systems.",
    "image": "/images/leadership/tom-baun.jpeg"
  },
  {
    "id": "14",
    "name": "Mike Hess",
    "title": "General Organizer",
    "bio": "Michael Hess was indentured into the Ironworkers Apprenticeship Training Program in 2000 at the age of 21 and served a three-year apprenticeship in Local 7 Boston. During his time in the field as an ironworker he worked in various facets of the trade, reinforcing, structural, miscellaneous metals and ornamental. Throughout his time in the field, he worked as a steward on various projects and worked as a foreman for several different signatories. In 2012 he was elected to the executive board for three years, following that term he was elected President of the local in 2015. During his time as President, he became appointed to the Business Agent Boston/West position in 2016. In March of 2020 he was appointed to the role of Business Manager. Throughout this time, he held several positions including Trustee to the Boston Building Trades Council, Vice President to the Massachusetts AFL-CIO, Massachusetts Building Trades Council Executive Board Member and Board Member to the Massachusetts Coalition for Occupational Safety and Health.",
    "image": "/images/leadership/mike-hess.png"
  },
  {
    "id": "15",
    "name": "Zach Gorman",
    "title": "General Organizer",
    "bio": "Bio content pending.",
    "image": "/images/leadership/zach-gorman.png"
  },
  {
    "id": "16",
    "name": "Johnny Cangey",
    "title": "General Organizer",
    "bio": "John Cangey was indentured into the Ironworkers Apprenticeship Training Program in Los Angeles in 1996 at the age of 18. Throughout his 21 years in the field, he worked as an ironworker apprentice, journeyman, foreman, general foreman and superintendent for several signatory contractors throughout the Southern California and Las Vegas areas. John was appointed as Business Agent for Local 433 (Los Angeles / Las Vegas) in 2017. He excelled in the performance of his Business Agent responsibilities, organizing several non-union projects, recruiting hundreds of apprentices into the Ironworkers Apprenticeship and building relationships with developers, local politicians and influential members of the community resulting in the coordination and negotiation of multiple Community Workforce Agreements and Project Labor Agreements. In 2020, John was appointed as Planning Commissioner of his community of Buena Park and to the Citizens Oversight Committee for the Centralia School District. In 2021, John was hired by IMPACT as the Western Regional Director. He remains committed to promoting the Iron Workers and providing members with easily accessible quality training for all facets of the trade.",
    "image": "/images/leadership/johnny-cangey.png"
  },
  {
    "id": "17",
    "name": "Bert Royer",
    "title": "General Organizer",
    "bio": "Bert Royer is a 51-year member of the Iron Workers Union and former financial secretary-treasurer/business manager of Local No. 771, Regina, Saskatchewan. He became IMPACT's Canadian Regional Director in April 2012. Mr. Royer was first indentured as an apprentice with Local 711, Montreal, Quebec, in 1974, where he served for four years. In 1979, Mr. Royer transferred his membership to Local No. 771, Regina, Saskatchewan, where he worked as a connector, foreman and general foreman on numerous industrial construction projects. Throughout his career, Mr. Royer has held several prominent industry positions, including labor co-chair of the Construction Opportunities Development Council of Saskatchewan and President of the Saskatchewan Provincial Building and Construction Trades Council (for which he served four terms). In addition, Mr. Royer served one term on the Canadian Board of International Foundation of Employee Benefits.",
    "image": "/images/leadership/bert-royer.jpg"
  }
]
