[
  {
    "id": "1",
    "name": "Arcola Community School",
    "slug": "arcola-community-school",
    "location": "Regina, SK",
    "category": "Education",
    "image": "/images/construction-wide.png"
  },
  {
    "id": "2",
    "name": "269 A Street",
    "slug": "269-a-street",
    "location": "Boston, MA",
    "category": "Commercial",
    "image": "/images/timber-beams-wide.png"
  },
  {
    "id": "3",
    "name": "Goldfinch Lofts",
    "slug": "goldfinch-lofts",
    "location": "Des Moines, IA",
    "category": "Low Rise",
    "image": "/images/panoramic-beams.png"
  },
  {
    "id": "4",
    "name": "355 Sango Court",
    "slug": "355-sango-court",
    "location": "Milpitas, CA",
    "category": "Commercial",
    "image": "/images/clean-interior.png"
  },
  {
    "id": "5",
    "name": "Community Ice Stadium / Mighty Ducks Practice Facility",
    "slug": "community-ice-stadium",
    "location": "Anaheim, CA",
    "category": "Civic Recreational",
    "image": "/images/hero-interior.png"
  },
  {
    "id": "6",
    "name": "The Preserve LA",
    "slug": "the-preserve-la",
    "location": "Los Angeles, CA",
    "category": "Commercial",
    "image": "/images/timber-ceiling.png"
  },
  {
    "id": "7",
    "name": "Bungalows on Marathon Street",
    "slug": "bungalows-marathon",
    "location": "Los Angeles, CA",
    "category": "Low Rise",
    "image": "/images/about-hero.jpg"
  },
  {
    "id": "8",
    "name": "843 North Spring Street",
    "slug": "843-north-spring",
    "location": "Los Angeles, California",
    "category": "Commercial",
    "image": "/images/timber-frame-wide.jpg"
  },
  {
    "id": "9",
    "name": "University of Washington Tacoma Milgard Hall",
    "slug": "uw-tacoma-milgard",
    "location": "Tacoma, WA",
    "category": "Education",
    "image": "/images/workers-installing.png"
  },
  {
    "id": "10",
    "name": "Hilltop Heritage Elementary School (ES No. 16)",
    "slug": "hilltop-heritage",
    "location": "Renton, WA",
    "category": "Education",
    "image": "/images/site-overview.jpg"
  },
  {
    "id": "11",
    "name": "National Nordic Museum",
    "slug": "national-nordic-museum",
    "location": "Seattle, WA",
    "category": "Civic Recreational",
    "image": "/images/connector-detail.png"
  },
  {
    "id": "12",
    "name": "Walmart Home Office Campus",
    "slug": "walmart-home-office-campus",
    "location": "Bentonville, AR",
    "category": "Commercial",
    "image": "/images/projects/walmart-home-office/of01-south-west.jpg",
    "featured": true,
    "award": "winner",
    "owner": "Walmart, Inc.",
    "contractor": "FOUST Fabrication & Erectors",
    "generalContractor": "Shawmut Design & Construction / Structuretone Layton",
    "ironworkerHours": 78426,
    "localUnion": "Local Union 0010",
    "sqft": "1.2 million",
    "description": "At the time of construction, this was the largest volume of mass timber construction in North America — a defining moment for both the ironworking trade and the broader construction industry. This groundbreaking project combined structural steel erection with the precision and care required for mass timber installation at a scale rarely seen before, delivering a hybrid structure that is as beautiful as it is efficient. All mass timber was sourced locally from Southern Yellow Pine, a renewable resource grown and harvested in the surrounding region.",
    "scope": "Complete structural erection of approximately 1.2 million square feet of mass timber and structural steel buildings — roughly half of the total campus footprint. This included the installation of all structural steel components such as columns, beams, joists, and metal decking, as well as the full erection of mass timber elements including glulam columns and beams, and cross-laminated timber (CLT) floor and roof panels. The team managed the interface between structural steel and mass timber with precision, ensuring alignment and performance across multiple mid-rise buildings under a highly accelerated construction schedule.",
    "challenges": "Mass timber deliveries began slipping, creating a cascading risk to the entire schedule. With no flexibility on the end date, the team completely restructured the field execution plan — transforming a standard single-crew, 40-hour-per-week schedule into a high-efficiency strategy deploying two cranes and two raising gangs per building, running six 10-hour days per week. This decisive pivot absorbed the delay entirely in the field, delivering the project on time without compromise.",
    "innovations": "The team utilized composite crews, combining union ironworkers and union carpenters to align specific skillsets to the unique installation needs of the project. Ironworkers led the erection scope — executing rigging, heavy picks, and structural connections with precision — while targeted carpenter support maintained installation momentum during timber work phases. This collaborative labor strategy demonstrated how the union workforce can solve real-world challenges on the most demanding projects.",
    "safety": "Every crew member took personal ownership of the safety culture on-site. Pre-task planning, daily safety huddles, and stop-work authority were embedded in how the team worked. Crews remained vigilant in high-risk scenarios such as working at height, rigging massive glulam members and CLT panels, and coordinating crane picks in active zones.",
    "gallery": [
      "/images/projects/walmart-home-office/of01-south-west.jpg",
      "/images/projects/walmart-home-office/of06-w-facade-3.14.22.jpg",
      "/images/projects/walmart-home-office/view-4.jpg",
      "/images/projects/walmart-home-office/view-5.jpg",
      "/images/projects/walmart-home-office/l-v02.jpg",
      "/images/projects/walmart-home-office/of03-east.jpg",
      "/images/projects/walmart-home-office/Full-View-of-Buiding-Using-Mass-Timber.jpg",
      "/images/projects/walmart-home-office/Close-View-of-Beams-Using-Mass-Timber.jpg",
      "/images/projects/walmart-home-office/Inside-Construction-with-Mass-Timber.jpg",
      "/images/projects/walmart-home-office/Wide-View-of-Mass-Timber-Buildings.jpg"
    ]
  },
  {
    "id": "13",
    "name": "Apple Miami World Center",
    "slug": "apple-miami-world-center",
    "location": "Miami, FL",
    "category": "Commercial",
    "image": "/images/projects/apple-miami/Apple 1.jpg",
    "featured": true,
    "award": "submitted",
    "owner": "Apple Inc.",
    "contractor": "Hodges Erectors, Inc.",
    "generalContractor": "Promethean Builders",
    "ironworkerHours": 4718,
    "localUnion": "Local Union 0272",
    "description": "The first free-standing mass timber and structural steel hybrid commercial building in the City of Miami. Designed by Apple's in-house team to achieve lower carbon emissions while featuring flawless finishes and natural materials, this technically demanding project redefines what's possible when innovation, precision, and collaboration come together. The structural steel framing served as the backbone of the building, providing primary support for mass timber components and enabling the expansive, open interior that defines the store's welcoming atmosphere.",
    "scope": "The building was composed of galvanized structural steel framing and mass timber members. With zero tolerance during erection, the team worked hand-in-hand with the mass timber subcontractor, reworking all connections that attached to the steel framing due to fabrication issues at the mass timber factory. The scope also included the fascia galvanized structural trim around the roof perimeter that attached to the mass timber roof members — the signature feature element of the building's exterior.",
    "challenges": "Although steel cambers were predesigned, the moment mass timber loads were introduced, the original camber calculations proved insufficient. As the hybrid structure evolved and Florida moisture levels took effect, the building began to sag. The team worked tirelessly, adjusting all cantilevered members to triple positive cambers until achieving a post-camber tolerance of max 1/8 inch.",
    "innovations": "As Miami's first hybrid steel/mass timber commercial building, the project demanded adaptability beyond precision. The steel was set to exact elevations, but as the hybrid structure evolved under Florida's moisture conditions, the team developed new field techniques for managing the interaction between steel rigidity and timber flexibility — a powerful lesson that mass timber buildings demand both precision and adaptability.",
    "safety": "Since this was the team's first hybrid structural building working with mass timber, safety was a constant focus reinforced during each morning's huddle. The project implemented the strictest hot work program of any project to date, which proved crucial in preventing fire ignition around the timber elements. The project was completed without a recordable incident.",
    "gallery": [
      "/images/projects/apple-miami/Apple 1.jpg",
      "/images/projects/apple-miami/Apple 2.jpg",
      "/images/projects/apple-miami/Apple 3.jpg",
      "/images/projects/apple-miami/Apple 5.jpg",
      "/images/projects/apple-miami/Apple 6.jpg",
      "/images/projects/apple-miami/Apple 7.jpg"
    ]
  }
]
